package acm.compan360;

//小明得到一个只包含a,b两个字符的字符串，但是小明不希望在这个字符串里a出现在b左边。现在他可以将”ab”这样的子串替换成”bba”，在原串中的相对位置不变。输出小明最少需要操作多少次才能让一个给定字符串所有a都在b的右边。
//
//
//        输入描述:
//        一个只包含a,b字符的字符串，长度不超过100000。
//
//
//        输出描述:
//        最小的操作次数。结果对1000000007取模。
//
//
//        输入例子1:
//        ab
//
//        输出例子1:
//        1
//
//        例子说明1:
//        ab到bba
//
//
//        输入例子2:
//        aab
//
//        输出例子2:
//        3
//
//        例子说明2:
//        aab到abba到bbaba到bbbbaa

public class t_ab_string {
}
